package boj.구현;

import java.io.BufferedReader;
import java.io.IOException;
import java.io.InputStreamReader;
import java.util.StringTokenizer;

public class Hashing {
    static final int M = 1234567891;
    static final int R = 31;
    public static void main(String[] args) throws IOException {
        /*
        * APC에 온 것을 환영한다. 만약 여러분이 학교에서 자료구조를 수강했다면 해시 함수에 대해 배웠을 것이다.
        * 해시 함수란 임의의 길이의 입력을 받아서 고정된 길이의 출력을 내보내는 함수로 정의한다. 해시 함수는 무궁무진한 응용 분야를 갖는데, 대표적으로 자료의 저장과 탐색에 쓰인다.
        * 이 문제에서는 여러분이 앞으로 유용하게 쓸 수 있는 해시 함수를 하나 가르쳐주고자 한다. 먼저, 편의상 입력으로 들어오는 문자열에는 영문 소문자(a, b, ..., z)로만 구성되어있다고 가정하자.
        * 영어에는 총 26개의 알파벳이 존재하므로 a에는 1, b에는 2, c에는 3, ..., z에는 26으로 고유한 번호를 부여할 수 있다. 결과적으로 우리는 하나의 문자열을 수열로 변환할 수 있다. 예를 들어서 문자열 "abba"은 수열 1, 2, 2, 1로 나타낼 수 있다.
        * 해시 값을 계산하기 위해서 우리는 문자열 혹은 수열을 하나의 정수로 치환하려고 한다.
        * 간단하게는 수열의 값을 모두 더할 수도 있다. 해시 함수의 정의에서 유한한 범위의 출력을 가져야 한다고 했으니까 적당히 큰 수 M으로 나눠주자.
        *  짜잔! 해시 함수가 완성되었다. 이를 수식으로 표현하면 아래와 같다.
        * 해시 함수의 입력으로 들어올 수 있는 문자열의 종류는 무한하지만 출력 범위는 정해져있다.
        * 다들 비둘기 집의 원리에 대해서는 한 번쯤 들어봤을 것이다. 그 원리에 의하면 서로 다른 문자열이더라도 동일한 해시 값을 가질 수 있다.
        * 이를 해시 충돌이라고 하는데, 좋은 해시 함수는 최대한 충돌이 적게 일어나야 한다. 위에서 정의한 해시 함수는 알파벳의 순서만 바꿔도 충돌이 일어나기 때문에 나쁜 해시 함수이다. 그러니까 조금 더 개선해보자.
        * 어떻게 하면 순서가 달라졌을때 출력값도 달라지게 할 수 있을까? 머리를 굴리면 수열의 각 항마다 고유한 계수를 부여하면 된다는 아이디어를 생각해볼 수 있다.
        * 가장 대표적인 방법은 항의 번호에 해당하는 만큼 특정한 숫자를 거듭제곱해서 곱해준 다음 더하는 것이 있다. 이를 수식으로 표현하면 아래와 같다.
        * 보통 r과 M은 서로소인 숫자로 정하는 것이 일반적이다. 우리가 직접 정하라고 하면 힘들테니까 r의 값은 26보다 큰 소수인 31로 하고 M의 값은 1234567891(놀랍게도 소수이다!!)로 하자.
        * 이제 여러분이 할 일은 위 식을 통해 주어진 문자열의 해시 값을 계산하는 것이다. 그리고 이 함수는 간단해 보여도 자주 쓰이니까 기억해뒀다가 잘 써먹도록 하자.
        *
        * 입력
        * 첫 줄에는 문자열의 길이 L이 들어온다. 둘째 줄에는 영문 소문자로만 이루어진 문자열이 들어온다.
        * 입력으로 주어지는 문자열은 모두 알파벳 소문자로만 구성되어 있다.
        *
        * 출력
        * 문제에서 주어진 해시함수와 입력으로 주어진 문자열을 사용해 계산한 해시 값을 정수로 출력한다.
        * */

        BufferedReader br = new BufferedReader(new InputStreamReader(System.in));
        StringTokenizer st = new StringTokenizer(br.readLine());
        int l = Integer.parseInt(st.nextToken());
        String s = br.readLine();

        /* 1. 문자열 s로 들어오는 abc.. 를 수열 1,2,3.. 으로 치환.
        * 2. 적당히 큰 수 M으로 나눠준다. (M = 1234567891)
        * 3. 항의 번호에 해당하는 만큼 특정 숫자를 거듭제곱해서 곱해준 다음 더한다. 이 거듭제곱은 r이라 하고, r = 31 이다.
        * -> 문자열을 수열로 바꾸고, r의 i제곱을 곱해서 더하고, M으로 나눈다.
        * */

        long answer = 0;
        long pow = 1; // r^0

        for (int i = 0; i < l; i++) {
            int val = s.charAt(i) - 'a' + 1; // 1~26 설정하기
            answer = (answer + val * pow) % M;
            pow = (pow * R) % M; // 다음 자리용 r^(i+1)
        }
        System.out.println(answer);

        /*
         * 문제 레벨 : 브론즈 2
         * 제한 시간 : 20분
         * 걸린 시간 : 20분 초과.
         * 해결 과정 : 문제를 이해하는 것 자체가 어려웠다.. 수포자의 삶이란ㅠㅠ
         * 어려웠던 점(아쉬운 점) : 문제 풀면서 항상 느끼는 것이지만 내가 원하는 값들을 어떻게 처리하는 지를 잘 모른다.
         * 머릿속으로는 생각이 나는데 그걸 어떻게 코드로 풀어서 해야할지 모르겠음
         * 개선 포인트 :
         * AI의 도움을 받았기 때문에 이해하는 것까지만 했다.
         * */

    }
}
