# 문제 : 모험가 길드
# 한 마을에 모험가가 N명 있다. 모험가 길드에서는 N명의 모험가를 대상으로 '공포도'를 측정했는데,
# '공포도'가 높은 모험가는 쉽게 공포를 느껴 위험 상황에서 제대로 대처할 능력이 떨어진다.
# 모험가 길드장인 동빈이는 모험가 그룹을 안전하게 구성하고자 공포도가 X인 모험가는 반드시 X명 이상으로 구성한 모험가 그룹에 
# 참여해야 여행을 떠날 수 있도록 규정했다.
# 동빈이는 최대 몇 개의 모험가 그룹을 만들 수 있는지 궁금하다.
# N명의 모험가에 대한 정보가 주어졌을 때, 여행을 떠날 수 있는 그룹 수의 최대값을 구하는 프로그램을 작성하시오.

# 예를 들어 N=5이고, 각 모험가의 공포도가 2, 3, 1, 2, 2 라고 가정하자.
# 이때 그룹 1에 공포도가 1, 2, 3인 모험가를 한 명씩 넣고, 그룹 2에 공포도가 2인 남은 모험가를 넣게 되면,
# 총 2개의 그룹을 만들 수 있다.
# 또한 몇 명의 모험가는 마을에 그대로 남아 있어도 되기 때문에, 모든 모험가를 특정한 그룹에 넣을 필요는 없다.

# 문제 해결 아이디어
# 1. 오름차순 정렬 이후에 공포도가 가장 낮은 모험가부터 하나씩 확인한다.
# 2. 앞에서부터 공포도를 하나씩 확인하며 '현재 그룹에 포함된 모험가 수'가
#  '현재 확인하고 있는 공포도'보다 크거나 같다면 이를 그룹으로 설정하면 된다.
# 3. 이러한 방법을 이용하면 공포도가 오름차순으로 정렬되어 있어 항상 최소한의 모험가의 수만 포함하여 그룹을 결성하게 된다.

# 문제 해결
n = int(input()) # 모험가 수 입력
data = list(map(int, input().split())) # 공포도 입력
data.sort() # 공포도를 오름차순으로 정렬

result = 0 # 총 그룹의 수
count = 0 # 현재 그룹에 포함된 모험가의 수

for i in data: # 공포도를 낮은 것부터 하나씩 확인하며
    count += 1 # 현재 그룹에 해당 모험가를 포함시키기
    if count >= i: # 현재 그룹에 포함된 모험가의 수가 현재의 공포도 이상이라면, 그룹 결정
        result += 1 # 총 그룹 수 증가 시키기
        count = 0 # 현재 그룹에 포함된 모험가의 수 초기화

print(result)